export const PAIR_SCHEDULES: Record<number, Array<{ start: string, end: string }>> = {
  // Понедельник (1) - особое расписание
  1: [
    { start: "09:10", end: "10:40" },
    { start: "10:50", end: "12:20" },
    { start: "12:50", end: "14:20" },
    { start: "14:30", end: "16:00" },
    { start: "16:10", end: "17:40" },
    { start: "17:50", end: "19:20" }
  ],
  // Вторник (2) - стандартное расписание
  2: [
    { start: "08:30", end: "10:00" },
    { start: "10:10", end: "11:40" },
    { start: "12:10", end: "13:40" },
    { start: "13:50", end: "15:20" },
    { start: "15:30", end: "17:00" },
    { start: "17:10", end: "18:40" },
    { start: "18:50", end: "20:20" }
  ],
  // Среда (3) - стандартное расписание
  3: [
    { start: "08:30", end: "10:00" },
    { start: "10:10", end: "11:40" },
    { start: "12:10", end: "13:40" },
    { start: "13:50", end: "15:20" },
    { start: "15:30", end: "17:00" },
    { start: "17:10", end: "18:40" },
    { start: "18:50", end: "20:20" }
  ],
  // Четверг (4) - особое расписание
  4: [
    { start: "08:30", end: "10:00" },
    { start: "10:10", end: "11:40" },
    { start: "13:00", end: "14:30" },
    { start: "14:40", end: "16:10" },
    { start: "16:20", end: "17:50" },
    { start: "18:00", end: "19:30" },
  ],
  // Пятница (5) - стандартное расписание
  5: [
    { start: "08:30", end: "10:00" },
    { start: "10:10", end: "11:40" },
    { start: "12:10", end: "13:40" },
    { start: "13:50", end: "15:20" },
    { start: "15:30", end: "17:00" },
    { start: "17:10", end: "18:40" },
    { start: "18:50", end: "20:20" }
  ]
};
